<!-- dflook/terraform-github-actions {"workspace":"tf-cloud-1-6","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"d875d142a5fb3ebcec45366b25f4590d1e8ace5ca355fbb4ba2ec2cec45e27f7","plan_job_ref":"Job Test plan target and replace #407 at https://github.com/dflook/terraform-github-actions/actions/runs/7848447466","plan_hash":"f5d7fee7fe4300fc662282997c54920ae00d7a4a15e2b35764a8f1378ed101dc","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tf-cloud-1-6__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "jdnObBJMNx" -> (known after apply)
!~  foreach = "rbonyRFrE9" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #407](https://github.com/dflook/terraform-github-actions/actions/runs/7848447466)